<?php

namespace Database\Factories;

use Faker\Generator;
use Illuminate\Database\Eloquent\Factories\Factory;

class spare_partFactory extends Factory
{
    protected $faker;

    public function definition(): array
    {
        $faker = app(Generator::class);

        return [
            'name_spare_part' =>  $faker->unique()->randomElement(array ("Привод передний","Полуось правая",
                "Пружина задняя","ШРУС внутренний","Полуось левая","Радиатор охлаждения","Амортизатор передний",
                "Ступица передняя","Шрус наружный","Крышка монтажного блока",
                "Ремонтный комплект","Тяга стабилизатора передняя","Подушка двигателя","Запчасти кузовные",
                "Амортизатор подвески","Кулак поворотный правый","Привод передний правый","Втулка направляющая",
                "Крестовина карданного вала","Глушитель","Вал приводной правый","Трипоид","Модуль зажигания",
                "Поршень суппорта","Рычаг передний","Опора шаровая",
                "Натяжитель ремня","Амортизатор подвески","Привод В Сборе","Колодки тормозные","Привод Спидометра",
                "Опора двигателя","Стойка стабилизатора","Пыльник",
                "Подшипник шариковый","Сальник ступичный","Тяга рулевая","Болт","Сервисный Комплект",
                "Пылезащитный комплект","Сайлентблок опоры","Кронштейн"
                )),

            'price' =>  $faker->numberBetween(10,50_00)*10
        ];
    }
}
